Revit 2027 API
XYZ.AngleTo Method
Returns the angle between this vector and the specified vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AngleTo(
	XYZ source
)
Public Function AngleTo (
	source As XYZ
) As Double
public:
double AngleTo(
	XYZ^ source
)
member AngleTo :
        source : XYZ -> float
Parameters
source XYZ
The specified vector.
Return Value
Double
The real number between 0 and PI equal to the angle between the two vectors in radians..
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when source is null.
Remarks
 The angle between the two vectors is measured in the plane spanned by them.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace